{"id":"business/live/2023/apr/25/price-rises-nestle-profits-uk-grocery-inflation-cbi-business-live","title":"UK grocery inflation dips to 17.3% as prices pressures ease; NatWest chair Howard Davies to leave by next summer – business live","body":"\u003cdiv id\u003d\"block-6447ad2d8f084a2f5d00fdf3\" class\u003d\"block is-key-event\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T10:45:24.089Z\"\u003e11.45am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e   \u003ch2 class\u003d\"block-title\"\u003eBroadbent: inflation may be turning lower....\u003c/h2\u003e  \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003e\u003cstrong\u003eBack in London, the Bank of England deputy governor Ben Broadbent has said there are signs that inflation pressures are easing.\u003c/strong\u003e\u003c/p\u003e \u003cp\u003eBroadbent told this morning’s event at NIESR (\u003ca href\u003d\"https://www.theguardian.com/business/live/2023/apr/25/price-rises-nestle-profits-uk-grocery-inflation-cbi-business-live?page\u003dwith:block-644799f88f086890899d96ed#block-644799f88f086890899d96ed\"\u003esee earlier post\u003c/a\u003e) that:\u003c/p\u003e \u003cblockquote class\u003d\"quoted\"\u003e \u003cp\u003e“In the last three months, notwithstanding the release we had last week, there are signs in the official data and also in the surveys of some of that pressure starting to come off - not nearly to the extent that we need it to, but some of it just may be beginning to turn.”\u003c/p\u003e \u003c/blockquote\u003e \u003cp\u003eInflation only dropped to 10.1% in March, higher than expected, while this morning’s Kantar grocery data has shown \u003ca href\u003d\"https://www.theguardian.com/business/live/2023/apr/25/price-rises-nestle-profits-uk-grocery-inflation-cbi-business-live?filterKeyEvents\u003dfalse\u0026amp;page\u003dwith:block-64477b878f08155e59b78318#block-64477b878f08155e59b78318\"\u003ea small drop in price rises in the last four weeks\u003c/a\u003e. \u003c/p\u003e \u003cp\u003eOn Sunday, the BoE’s former chief economist, Andy Haldane, predicted inflation would soon head south:\u003c/p\u003e \u003caside class\u003d\"element element-rich-link element--thumbnail\"\u003e \u003cp\u003e \u003cspan\u003eRelated: \u003c/span\u003e\u003ca href\u003d\"https://www.theguardian.com/business/2023/apr/23/uk-inflation-will-fall-rapidly-says-ex-bank-of-england-economist-andy-haldane\"\u003eUK inflation will fall rapidly, says ex-Bank of England economist\u003c/a\u003e \u003c/p\u003e \u003c/aside\u003e  \u003cp\u003eAsked if the BoE would consider raising interest rates by half a percentage point at its next meeting in May, Broadbent said the central bank did not rule out specific moves before its monetary policy meetings, Reuters reports.\u003c/p\u003e \u003cp\u003eThe money markets predict the Bank will raise borrowing costs by a quarter-of-one-percent next month, to 4.5%.\u003c/p\u003e \u003c/div\u003e   \u003c/div\u003e \u003cdiv id\u003d\"block-6447ab408f084a2f5d00fdce\" class\u003d\"block\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T10:29:20.077Z\"\u003e11.29am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e    \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003e\u003cstrong\u003eAlison Rose\u003c/strong\u003e, \u003cstrong\u003eNatWest’s\u003c/strong\u003e CEO, tells shareholders at today’s Edinburgh AGM that UK households and businesses are struggling.\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eRose\u003c/strong\u003e explains:\u003c/p\u003e \u003cblockquote class\u003d\"quoted\"\u003e \u003cp\u003eI, and my Executive team, continue to monitor the market movements closely to ensure that we are well placed to continue supporting our customers.\u003c/p\u003e \u003cp\u003eYet, despite not seeing significant signs of financial distress or changes in behaviour amongst our customers, we know that people, families, and businesses across the country are struggling.\u003c/p\u003e \u003c/blockquote\u003e \u003c/div\u003e   \u003c/div\u003e \u003cdiv id\u003d\"block-6447a7898f0802b5b51ddae2\" class\u003d\"block is-key-event\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T10:17:03.456Z\"\u003e11.17am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e   \u003ch2 class\u003d\"block-title\"\u003eHoward Davies to leave NatWest by next summer\u003c/h2\u003e  \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003e\u003cstrong\u003eNatWest chair Howard Davies, who is one of the longest serving bank bosses in the UK, is also preparing to step down by 2024:\u003c/strong\u003e\u003c/p\u003e \u003cp\u003eDavies told shareholders at today’s AGM that a ‘rigorous search process’ will take place, so he can step down before he has spent nine years at the bank.\u003c/p\u003e \u003cp\u003eHe says:\u003c/p\u003e \u003cblockquote class\u003d\"quoted\"\u003e \u003cp\u003eI am approaching the point where I will have served 8 years on the Board so it is appropriate to initiate the search for my successor as Chairman in the coming months.\u003c/p\u003e \u003cp\u003eThis will allow time for a rigorous search process and an orderly handover, which I expect will take place at some point before I reach nine years tenure in July 2024.\u003c/p\u003e \u003cp\u003eThat is the maximum recommended in the UK Corporate Governance Code. The search for my successor will be led jointly by the Senior Independent Directors of NatWest Group and NatWest Holdings.\u003c/p\u003e \u003c/blockquote\u003e \u003c/div\u003e   \u003c/div\u003e \u003cdiv id\u003d\"block-6447a7028f0802b5b51ddad6\" class\u003d\"block is-key-event\" data-block-contributor\u003d\"profile/kalyeena-makortoff\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T10:13:27.576Z\"\u003e11.13am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e   \u003ch2 class\u003d\"block-title\"\u003eNatWest chair: \u0027robust and resilient balance sheet\u0027 helped us through uncertainty\u003c/h2\u003e  \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003e\u003cstrong\u003eNatWest chairman Howard Davies has tried to assure shareholders gathered at the bank’s Gogarburn HQ for its AGM in Edinburgh this morning that the bank’s own fortunes were secure, despite last months’ banking crisis.\u003c/strong\u003e\u003c/p\u003e \u003cp\u003eWe’ll see whether shareholders are feeling as optimistic once we get to Q\u0026amp;As, but the chair said the bank had a “robust and resilient balance sheet” and was watching developments closely.\u003c/p\u003e \u003cp\u003eIn opening remarks, Davies said: \u003c/p\u003e \u003cblockquote class\u003d\"quoted\"\u003e \u003cp\u003e“In the first few months of the year, we have already seen the impact that uncertainty and rising interest rates can have on the banking sector, with the collapse of Silicon Valley Bank in the United States and some other lenders there.\u003c/p\u003e \u003cp\u003eWe also saw the acquisition of Credit Suisse by UBS, facilitated by the Swiss authorities. Ultimately, poor risk management and long-standing, idiosyncratic challenges were largely to blame for those failures. The NatWest Group, by contrast, has built a robust and resilient balance sheet with strong capital and liquidity, a largely secured retail loan book and well-diversified commercial lending.\u003c/p\u003e \u003cp\u003eTight risk management underpins our strategy and ensures we are well-positioned for the future. We nonetheless continue to monitor customer activity and behaviours closely for signs of stress, taking action where appropriate.”\u003c/p\u003e \u003c/blockquote\u003e \u003c/div\u003e   \u003c/div\u003e \u003cdiv id\u003d\"block-644799f88f086890899d96ed\" class\u003d\"block is-key-event\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T09:35:58.077Z\"\u003e10.35am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e   \u003ch2 class\u003d\"block-title\"\u003eBoE\u0027s Broadbent: QE not responsible for surging inflation\u003c/h2\u003e  \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003e\u003cstrong\u003eBen Broadbent, deputy governor of the Bank of England, is rebuffing claims that the Bank’s quantitative easing (QE) programme has fuelled the surge in inflation.\u003c/strong\u003e\u003c/p\u003e \u003cp\u003eThe Bank bought up £435bn of government bonds after the 2008 financial crisis, and boosted the total to almost £900bn once the Covid-19 pandemic hit the economy.\u003c/p\u003e \u003cp\u003eToday, Broadbent is giving \u003ca href\u003d\"https://www.bankofengland.co.uk/-/media/boe/files/speech/2023/april/monetary-policy-prices-versus-quantities-speech-by-ben-broadbent.pdf\"\u003ea (long) speech\u003c/a\u003e to the National Institute of Economic and Social Research (NIESR), exploring whether the UK’s cost-of-living surge is due to the growth in broad money (the balance sheets of commercial banks), and whether both can be blamed on QE.\u003c/p\u003e \u003cp\u003eIn a defence of the Bank’s policies, Broadbent argues that the highest inflation since the 1970s can’t be blamed on QE – which involves the creation of central bank reserves to buy financial assets from commercial banks.\u003c/p\u003e \u003cp\u003eBroadbent insists:\u003c/p\u003e \u003cblockquote class\u003d\"quoted\"\u003e \u003cp\u003eCertainly the very strongest claims – that QE inevitably leads to rapid growth of commercial bank deposits (M4), on a par with that in the central bank’s balance sheet; and that this, in turn, inevitably leads to excessive inflation – are not well supported by the evidence.\u003c/p\u003e \u003c/blockquote\u003e \u003cp\u003eBroadbent points out that the first bout of QE, following the collapse of Lehman Brothers, did not spark a surge in prices. He says:\u003c/p\u003e \u003cblockquote class\u003d\"quoted\"\u003e \u003cp\u003eIn the decade or so that passed between the first use of the policy in 2009 and the onset of the pandemic, reserves grew extremely rapidly.\u003c/p\u003e \u003cp\u003eYet broad money growth was significantly slower than it had been before the crisis (Chart 1).\u003c/p\u003e \u003c/blockquote\u003e  \u003cfigure class\u003d\"element element-image\" data-media-id\u003d\"8f54a994fb547552686fb11f733641912e812fb5\"\u003e \u003cimg src\u003d\"https://media.guim.co.uk/8f54a994fb547552686fb11f733641912e812fb5/11_13_1286_809/1000.jpg\" alt\u003d\"A graph from a speech by Ben Broadbent\" width\u003d\"1000\" height\u003d\"629\" class\u003d\"gu-image\" /\u003e \u003cfigcaption\u003e \u003cspan class\u003d\"element-image__caption\"\u003eA graph from a speech by Ben Broadbent\u003c/span\u003e \u003cspan class\u003d\"element-image__credit\"\u003ePhotograph: Bank of England\u003c/span\u003e \u003c/figcaption\u003e \u003c/figure\u003e  \u003cp\u003eHe adds:\u003c/p\u003e \u003cblockquote class\u003d\"quoted\"\u003e \u003cp\u003eAnd, in both periods, average inflation was close to 2% (Chart 2).\u003c/p\u003e \u003c/blockquote\u003e  \u003cfigure class\u003d\"element element-image\" data-media-id\u003d\"f93f04171af318d8dc8e549322137aa796dff89d\"\u003e \u003cimg src\u003d\"https://media.guim.co.uk/f93f04171af318d8dc8e549322137aa796dff89d/14_13_1271_780/1000.jpg\" alt\u003d\"A chart from a speech by Ben Broadbent\" width\u003d\"1000\" height\u003d\"614\" class\u003d\"gu-image\" /\u003e \u003c/figure\u003e  \u003cp\u003eSo what did cause UK consumer price inflation to hit double-digit levels?\u003c/p\u003e \u003cp\u003eBroadbent says it’s clear – supply-chain problems in the pandemic which pushed up goods prices, followed by the surge in energy and food prices following the Ukraine war.\u003c/p\u003e \u003cblockquote class\u003d\"quoted\"\u003e \u003cp\u003eIn this case it’s clear what those have been: the hits to the supply of non-energy goods during the pandemic, to those of energy and food during the war, and the resulting rise in their global prices.\u003c/p\u003e \u003cp\u003eThanks to the significant hit to real incomes they involved, these shocks have also had sizeable second-round effects on domestic wages and prices.\u003c/p\u003e \u003cp\u003eAs an explanation for the inflation we’ve experienced I think this fits the actual data better than the single fact of strong household money growth during the pandemic.\u003c/p\u003e \u003c/blockquote\u003e \u003cp\u003eThe 30-plus page speech is online \u003ca href\u003d\"https://www.bankofengland.co.uk/-/media/boe/files/speech/2023/april/monetary-policy-prices-versus-quantities-speech-by-ben-broadbent.pdf\"\u003ehere\u003c/a\u003e, and includes a handy explanation by Broadbent of the “IS-LM” model of how interest rates affect demand, which underpins macro-economics….. (although it rather pre-dates QE….)\u003c/p\u003e  \u003cfigure class\u003d\"element element-image\" data-media-id\u003d\"40969ae702606966a70da1982f9952f524fc9a55\"\u003e \u003cimg src\u003d\"https://media.guim.co.uk/40969ae702606966a70da1982f9952f524fc9a55/17_19_1252_747/1000.jpg\" alt\u003d\"A chart showing the IS-LM model\" width\u003d\"1000\" height\u003d\"597\" class\u003d\"gu-image\" /\u003e \u003c/figure\u003e \u003c/div\u003e   \u003cp class\u003d\"block-time updated-time\"\u003eUpdated \u003ctime datetime\u003d\"2023-04-25T09:43:47.958Z\"\u003eat 10.43am BST\u003c/time\u003e\u003c/p\u003e  \u003c/div\u003e \u003cdiv id\u003d\"block-644795f68f087731d3ccd516\" class\u003d\"block\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T09:14:27.463Z\"\u003e10.14am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e    \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003e\u003cstrong\u003eThousands of London Underground workers are to vote on whether to continue a campaign of strike action in a long-running dispute over jobs and pensions.\u003c/strong\u003e\u003c/p\u003e \u003cp\u003eMore than 10,000 members of the Rail, Maritime and Transport union (RMT) will be re-balloted in the coming weeks, as the union seeks a fresh mandate for industrial action.\u003c/p\u003e \u003cp\u003eThe union has been locked in a row with Transport for London (TfL) and the Mayor Sadiq Khan for nearly a year, over plans to cut jobs.\u003c/p\u003e \u003cp\u003eThe union says other plans have raised the prospect of Tube workers losing over 30% of their pensions.\u003c/p\u003e \u003cp\u003eThe ballot will run until the May 23 and the current mandate runs out in June.\u003c/p\u003e \u003cp\u003eRMT general secretary Mick Lynch said: \u003c/p\u003e \u003cblockquote class\u003d\"quoted\"\u003e \u003cp\u003e“Our members have taken several days of strike action over this last year and remain as determined as ever to get a just settlement on jobs, pensions and their working conditions.\u003c/p\u003e \u003cp\u003e“The Mayor is under pressure from central government, but he must join us in resisting them and refuse to allow ideologically motivated financial constraints to be used as an excuse to attack Tube workers.\u003c/p\u003e \u003cp\u003e“Transport for London has healthy revenue streams and our members are among the thousands of Tube staff that make it a successful transport provider.\u003c/p\u003e \u003cp\u003e“This re-ballot is vital to maintain the pressure on TfL and I urge all our members to vote yes in the postal ballot.”\u003c/p\u003e \u003c/blockquote\u003e  \u003cfigure class\u003d\"element element-tweet\" data-canonical-url\u003d\"https://twitter.com/Taj_Ali1/status/1650779619618897920\"\u003e  \u003cblockquote class\u003d\"twitter-tweet\"\u003e\u003cp lang\u003d\"en\" dir\u003d\"ltr\"\u003e🚨London Underground strike re-ballot begins🚈\u003cbr\u003e\u003cbr\u003eOver 10,000 \u003ca href\u003d\"https://twitter.com/RMTunion?ref_src\u003dtwsrc%5Etfw\"\u003e@RMTunion\u003c/a\u003e members across London Underground will be re-balloted for strike action from today in a dispute over jobs and pensions.\u003c/p\u003e\u0026mdash; Taj Ali (@Taj_Ali1) \u003ca href\u003d\"https://twitter.com/Taj_Ali1/status/1650779619618897920?ref_src\u003dtwsrc%5Etfw\"\u003eApril 25, 2023\u003c/a\u003e\u003c/blockquote\u003e  \u003c/figure\u003e \u003c/div\u003e   \u003c/div\u003e \u003cdiv id\u003d\"block-644790358f087731d3ccd4ef\" class\u003d\"block is-key-event\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T08:48:27.294Z\"\u003e9.48am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e   \u003ch2 class\u003d\"block-title\"\u003eFirst Republic woes weigh on markets\u003c/h2\u003e  \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003e\u003cstrong\u003eAnxiety over US regional bank First Republic is weighing on the stock markets today.\u003c/strong\u003e\u003c/p\u003e \u003cp\u003eLast night, First Republic reported that its deposits fell by over $100bn in the first quarter of this year.\u003c/p\u003e \u003cp\u003eShares fell over 20% in after-hours trading as First Republic, \u003ca href\u003d\"https://www.theguardian.com/us-news/2023/mar/17/first-thing-markets-on-alert-after-us-banks-join-forces-to-rescue-first-republic\"\u003ewhich recently received a $30bn lifeline\u003c/a\u003e, from major US banks, said it was exploring options including restructuring its balance sheet.\u003c/p\u003e \u003cp\u003eEuropean indices are in the red this morning, with Italy’s FTSE MIB down 1%, Spain’s IBEX losing 1.25%.\u003c/p\u003e \u003cp\u003eIn London, the FTSE 100 index is down 0.25% or 19 points at 7893 points.\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eRuss Mould\u003c/strong\u003e, investment director at \u003cstrong\u003eAJ Bell\u003c/strong\u003e, says investors certainly lost their appetite for banking stocks this morning:\u003c/p\u003e \u003cblockquote class\u003d\"quoted\"\u003e \u003cp\u003e“First Republic Bank’s latest results have restarted the market’s worry engine, triggering a sell-off across Europe. Its shares fell 22% in after-hours trading after revealing a sharp decline in deposits, prompting speculation it could be the next bank to be taken over.\u003c/p\u003e \u003cp\u003e“There are already concerns that banks in many parts of the world will choose to be more selective over whom they lend to, which in turn could have negative implications for the economy.\u003c/p\u003e \u003c/blockquote\u003e \u003c/div\u003e   \u003cp class\u003d\"block-time updated-time\"\u003eUpdated \u003ctime datetime\u003d\"2023-04-25T08:56:10.623Z\"\u003eat 9.56am BST\u003c/time\u003e\u003c/p\u003e  \u003c/div\u003e \u003cdiv id\u003d\"block-64478d6e8f087731d3ccd4ce\" class\u003d\"block is-key-event\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T08:28:23.140Z\"\u003e9.28am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e   \u003ch2 class\u003d\"block-title\"\u003eCentral banks end daily emergency dollar swaps\u003c/h2\u003e  \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003e\u003cstrong\u003eThe world’s top central banks are ending the emergency action they took last month to keep dollars flowing through the global financial system.\u003c/strong\u003e\u003c/p\u003e \u003cp\u003eThe Bank of England, Bank of Japan, the European Central Bank, the Swiss National Bank have decided to end \u003ca href\u003d\"https://www.theguardian.com/business/2023/mar/20/central-banks-around-world-move-to-boost-flow-of-cash-amid-confidence-concerns\"\u003ethe daily dollar-swap lines they set up with the Federal Reserve to reassure markets\u003c/a\u003e after the collapse of Silicon Valley Bank.\u003c/p\u003e \u003cp\u003eThey will return to holding weekly operations, a sign that calm has returned to markets.\u003c/p\u003e \u003cp\u003eThe Bank of England says they decision was taken in view of the improvements in u.s. dollar funding conditions and the low demand at recent US dollar liquidity-providing operations.\u003c/p\u003e \u003cp\u003eThe swap operations were designed to help central banks around the world to supply local banks with US dollars, an important safe haven asset, during times of market stress.\u003c/p\u003e \u003cp\u003e\u003ca href\u003d\"https://www.bloomberg.com/news/articles/2023-03-20/global-central-banks-daily-swap-lines-signal-no-dash-for-dollar?leadSource\u003duverify%20wall\u0026amp;sref\u003dXl91GI8N\"\u003eBut actually, demand for the swaps proved to be relatively limited\u003c/a\u003e, as the problems at SVB and Credit Suisse did not trigger a repeat of the 2008 crisis.\u003c/p\u003e \u003c/div\u003e   \u003cp class\u003d\"block-time updated-time\"\u003eUpdated \u003ctime datetime\u003d\"2023-04-25T08:31:50.789Z\"\u003eat 9.31am BST\u003c/time\u003e\u003c/p\u003e  \u003c/div\u003e \u003cdiv id\u003d\"block-644789928f087731d3ccd4b4\" class\u003d\"block is-key-event\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T08:17:24.541Z\"\u003e9.17am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e   \u003ch2 class\u003d\"block-title\"\u003eUK public sector borrowing jumps, but there\u0027s good news for Hunt too....\u003c/h2\u003e  \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003e\u003cstrong\u003eThe latest UK public finance figures show that government borrowing hit a near record in March.\u003c/strong\u003e\u003c/p\u003e \u003cp\u003ePublic sector net borrowing rose to £21.5bn in March, the second-highest March borrowing since monthly records began in 1993, and £16.3bn more than in March 2022.\u003c/p\u003e \u003cp\u003eAlthough public sector receipts rose by 2.3% to £88.8bn, helped by rising tax receipts, ths was offset by a 19.9% increase in public spending, to £110.3bn in March.\u003c/p\u003e \u003cp\u003eSpending was pushed up by the cost of capping energy costs for households and businesses, and the increased interest bill on inflation-linked government debt.\u003c/p\u003e  \u003cfigure class\u003d\"element element-tweet\" data-canonical-url\u003d\"https://twitter.com/ONS/status/1650742043566649345\"\u003e  \u003cblockquote class\u003d\"twitter-tweet\"\u003e\u003cp lang\u003d\"en\" dir\u003d\"ltr\"\u003ePublic sector net borrowing (excluding public sector banks) was £21.5 billion in March 2023.\u003cbr\u003e\u003cbr\u003eThis takes the full financial year total to £139.2 billion, up £18.1 billion on the previous year and the fourth highest since records began in 1946.\u003cbr\u003e\u003cbr\u003e➡️ \u003ca href\u003d\"https://t.co/aRFdicMNvO\"\u003ehttps://t.co/aRFdicMNvO\u003c/a\u003e \u003ca href\u003d\"https://t.co/8WkfBB2rkJ\"\u003epic.twitter.com/8WkfBB2rkJ\u003c/a\u003e\u003c/p\u003e\u0026mdash; Office for National Statistics (ONS) (@ONS) \u003ca href\u003d\"https://twitter.com/ONS/status/1650742043566649345?ref_src\u003dtwsrc%5Etfw\"\u003eApril 25, 2023\u003c/a\u003e\u003c/blockquote\u003e  \u003c/figure\u003e  \u003cp\u003eToday’s figures also show that the UK government borrowed £13.2bn less than expected in the last financial year.\u003c/p\u003e \u003cp\u003eBorrowing for the year to March was the fourth-highest on record at £139.2bn – below the £152.4bn forecast made last month by the \u003ca href\u003d\"https://viewer.gutools.co.uk/business/office-for-budget-responsibility\"\u003eOffice for Budget Responsibility\u003c/a\u003e.\u003c/p\u003e \u003cp\u003eThat may give the government some wriggle-room for tax cuts ahead of the next election.\u003c/p\u003e \u003cp\u003eThis morning’s data shows the government spent £41.2bn over the past six months to support households and businesses with energy costs.\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eChancellor Jeremy Hunt\u003c/strong\u003e said the government was right to spend on energy support in the cost-of-living crisis, but warned “we cannot borrow forever”.\u003c/p\u003e \u003cblockquote class\u003d\"quoted\"\u003e \u003cp\u003e“These numbers reflect the inevitable consequences of borrowing eye-watering sums to help families and businesses through a pandemic and (Vladimir) Putin’s energy crisis.”\u003c/p\u003e \u003cp\u003e“We stepped up to support the British economy in the face of two global shocks, but we cannot borrow forever.\u003c/p\u003e \u003c/blockquote\u003e  \u003cfigure class\u003d\"element element-tweet\" data-canonical-url\u003d\"https://twitter.com/ONS/status/1650742335959969798\"\u003e  \u003cblockquote class\u003d\"twitter-tweet\" data-conversation\u003d\"none\"\u003e\u003cp lang\u003d\"en\" dir\u003d\"ltr\"\u003ePublic sector debt excluding public sector banks was £2,530.4 billion, or around 99.6% of GDP, at the end of March.\u003cbr\u003e\u003cbr\u003eThe debt-to-GDP ratio was at levels last seen in the early 1960s.\u003cbr\u003e\u003cbr\u003e➡️ \u003ca href\u003d\"https://t.co/aRFdicMNvO\"\u003ehttps://t.co/aRFdicMNvO\u003c/a\u003e \u003ca href\u003d\"https://t.co/jKLe38pBt5\"\u003epic.twitter.com/jKLe38pBt5\u003c/a\u003e\u003c/p\u003e\u0026mdash; Office for National Statistics (ONS) (@ONS) \u003ca href\u003d\"https://twitter.com/ONS/status/1650742335959969798?ref_src\u003dtwsrc%5Etfw\"\u003eApril 25, 2023\u003c/a\u003e\u003c/blockquote\u003e  \u003c/figure\u003e \u003c/div\u003e   \u003c/div\u003e \u003cdiv id\u003d\"block-6447877d8f08155e59b78374\" class\u003d\"block\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T07:58:33.170Z\"\u003e8.58am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e    \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003eNestlé’s strong collection of brands helped it \u003ca href\u003d\"https://www.theguardian.com/business/live/2023/apr/25/price-rises-nestle-profits-uk-grocery-inflation-cbi-business-live?filterKeyEvents\u003dfalse\u0026amp;page\u003dwith:block-64476a8f8f087731d3ccd3d0#block-64476a8f8f087731d3ccd3d0\"\u003edrive through price hikes of almost 10% in the last quarter\u003c/a\u003e, explains \u003cstrong\u003eMatt Britzman\u003c/strong\u003e, equity analyst at \u003cstrong\u003eHargreaves Lansdown:\u003c/strong\u003e\u003c/p\u003e \u003cblockquote class\u003d\"quoted\"\u003e \u003cp\u003e“Nestlé’s showing just how important it is to have a strong suite of brands, which have allowed the consumer giant to push through some pretty hefty price hikes with little impact on volumes.\u003c/p\u003e \u003cp\u003eFrom Purina PetCare to KitKat, Nestlé’s host of strong brands are keeping their appeal despite rising prices and a consumer coming under ever-increasing pressure to cut back spending. Double-digit growth in confectionery and Petcare was impressive. It’s as important now as ever to keep sales moving in the right direction as higher input costs continue to linger.\u003c/p\u003e \u003cp\u003eNestlé seems to have that under control for now, and it’s always pleasing to see full-year profit guidance remaining intact when you consider the challenges facing both the business and the consumer.\u003c/p\u003e \u003c/blockquote\u003e \u003c/div\u003e   \u003c/div\u003e \u003cdiv id\u003d\"block-6447835f8f08155e59b7835f\" class\u003d\"block is-key-event\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T07:42:37.614Z\"\u003e8.42am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e   \u003ch2 class\u003d\"block-title\"\u003eAldi and Lidl hit new record market shares\u003c/h2\u003e  \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003eBritain’s discount grocery chains, Aldi and Lidl, both hit record market shares over the latest 12-week period at 10.1% and 7.6% respectively, Kantar reports.\u003c/p\u003e \u003cp\u003eBoth groups benefited from the pressure on household budgets, Kantar says:\u003c/p\u003e \u003cblockquote class\u003d\"quoted\"\u003e \u003cp\u003eLidl was the fastest growing grocer with sales increasing by 25.1%, while Aldi is just behind on 25.0%. Consumers are continuing to shop around, visiting at least three major retailers every month on average.\u003c/p\u003e \u003cp\u003eThe discounters have been big beneficiaries of this, with Aldi going past a 10% market share for the first time this month. \u003c/p\u003e \u003c/blockquote\u003e \u003c/div\u003e   \u003c/div\u003e \u003cdiv id\u003d\"block-6447815b8f08155e59b78357\" class\u003d\"block is-key-event\" data-block-contributor\u003d\"profile/sarahbutler\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T07:29:51.453Z\"\u003e8.29am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e   \u003ch2 class\u003d\"block-title\"\u003ePoor families miss out on budget ranges at big chains’ smaller shops, says Which?\u003c/h2\u003e  \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003e\u003cstrong\u003eLow-income families are missing out on the chance to pick up supermarkets’ lowest-priced essentials as fewer than 1% of the leading chains’ smaller stores stock them, according to a study.\u003c/strong\u003e\u003c/p\u003e \u003cp\u003eThe consumer group Which? dispatched mystery shoppers to hunt for a list of about 30 items under the cut-price own-label ranges in Sainsbury’s, Tesco, Asda and \u003ca href\u003d\"https://www.theguardian.com/business/morrisons\"\u003eMorrisons\u003c/a\u003e stores, including apples, beef mince, tinned tomatoes, rice and instant coffee.\u003c/p\u003e \u003cp\u003eOn average, the biggest supermarket stores had 87% of the products researchers were looking for, or an equivalent product in the same range.\u003c/p\u003e \u003cp\u003eHowever, in small \u003ca href\u003d\"https://www.theguardian.com/business/tesco\"\u003eTesco\u003c/a\u003e Express, Sainsbury’s Local and Morrisons Daily convenience stores, the budget own-label items on Which?’s list were available less than 1% of the time. Asda does not have a large number of small stores and so it was not included in that part of the study.\u003c/p\u003e \u003caside class\u003d\"element element-rich-link element--thumbnail\"\u003e \u003cp\u003e \u003cspan\u003eRelated: \u003c/span\u003e\u003ca href\u003d\"https://www.theguardian.com/business/2023/apr/25/poor-families-miss-out-on-budget-ranges-at-big-chains-smaller-shops-says-which\"\u003ePoor families miss out on budget ranges at big chains’ smaller shops, says Which?\u003c/a\u003e \u003c/p\u003e \u003c/aside\u003e \u003c/div\u003e   \u003c/div\u003e \u003cdiv id\u003d\"block-64477e338f08155e59b78327\" class\u003d\"block is-key-event\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T07:27:55.135Z\"\u003e8.27am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e   \u003ch2 class\u003d\"block-title\"\u003eJobs at risk as Ocado plans to shut Hatfield site\u003c/h2\u003e  \u003cdiv class\u003d\"block-elements\"\u003e  \u003cfigure class\u003d\"element element-image\" data-media-id\u003d\"206f14d66d01c5e15a2c890c385b4375f1c47cac\"\u003e \u003cimg src\u003d\"https://media.guim.co.uk/206f14d66d01c5e15a2c890c385b4375f1c47cac/0_232_3500_2101/1000.jpg\" alt\u003d\"Ocado\u0027s Customer Fulfilment Centre in Hatfield.\" width\u003d\"1000\" height\u003d\"600\" class\u003d\"gu-image\" /\u003e \u003cfigcaption\u003e \u003cspan class\u003d\"element-image__caption\"\u003eOcado\u0027s Customer Fulfilment Centre in Hatfield.\u003c/span\u003e \u003cspan class\u003d\"element-image__credit\"\u003ePhotograph: Daniel Leal-Olivas/PA\u003c/span\u003e \u003c/figcaption\u003e \u003c/figure\u003e  \u003cp\u003e\u003cstrong\u003eNewsflash: Ocado Retail is planning to shut its warehouse at Hatfield, putting 2,300 jobs at risk.\u003c/strong\u003e\u003c/p\u003e \u003cp\u003eOcado Retail, a 50/50 joint venture between Ocado Group and Marks \u0026amp; Spencer, says it is proposing closing the Hatfield customer fulfilment centre [CFC], which is the oldest site in the Ocado network.\u003c/p\u003e \u003cp\u003eOcado said it did not expect any change to the volume of orders fulfilled due to the stoppage of operations at Hatfield, north of London, and plans to move the order-processing done at Hatfield to other sites.\u003c/p\u003e \u003cp\u003eThat will include the new warehouse being built at Luton, where Ocado hopes to redeploy Hatfield staff. It says:\u003c/p\u003e \u003cblockquote class\u003d\"quoted\"\u003e \u003cp\u003eThere are currently around 2,300 employees based in Hatfield, and Ocado has now commenced a consultation process with colleagues on these proposals. \u003c/p\u003e \u003c/blockquote\u003e \u003cp\u003eThe consultation is expected to close in the summer 2023, with Hatfield operations expecting to halt when Luton starts operating.\u003c/p\u003e \u003cp\u003eExplaining the move, Ocado says its new robotic grocery-picking systems are faster than the original system at Hatfield:\u003c/p\u003e \u003cblockquote class\u003d\"quoted\"\u003e \u003cp\u003eThe latest generation of robotic CFCs are consistently achieving well over 200 units picked per labour hour within the facility (‘UPH’), compared to UPH of around 150 for our first generation CFC in Hatfield. The newest sites also have much lower energy usage.\u003c/p\u003e \u003c/blockquote\u003e \u003c/div\u003e   \u003c/div\u003e \u003cdiv id\u003d\"block-64477d8f8f087731d3ccd45c\" class\u003d\"block is-key-event\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T07:15:28.878Z\"\u003e8.15am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e   \u003ch2 class\u003d\"block-title\"\u003eKantar: Too early to call top on grocery inflation\u003c/h2\u003e  \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003e\u003cstrong\u003eThe latest drop in grocery price inflation will be welcome news for shoppers but it’s too early to call the top, says Kantar’s Fraser McKevitt.\u003c/strong\u003e\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eMcKevitt\u003c/strong\u003e explains:\u003c/p\u003e \u003cblockquote class\u003d\"quoted\"\u003e \u003cp\u003eWe’ve been here before when the rate fell at the end of 2022, only for it to rise again over the first quarter of this year.\u003c/p\u003e \u003cp\u003eWe think grocery inflation will come down soon, but that’s because we’ll start to measure it against the high rates seen last year. It’s important to remember, of course, that falling grocery inflation doesn’t mean lower prices, it just means prices aren’t increasing as quickly.\u003c/p\u003e \u003c/blockquote\u003e \u003c/div\u003e   \u003c/div\u003e \u003cdiv id\u003d\"block-64477b878f08155e59b78318\" class\u003d\"block is-key-event\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T07:11:02.318Z\"\u003e8.11am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e   \u003ch2 class\u003d\"block-title\"\u003eUK grocery inflation slows, but still 17.3%\u003c/h2\u003e  \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003e\u003cstrong\u003eIt’s official: UK grocery price inflation dipped slightly in April.\u003c/strong\u003e\u003c/p\u003e \u003cp\u003eData firm Kantar has confirmed that consumers are still paying 17.3% more than this time last year at UK supermarkets, as they told the Today programme this morning.\u003c/p\u003e \u003cp\u003eThat’s slightly lower than last month’s 17.5% grocery inflation, but still means that housholds are facing painful price hikes.\u003c/p\u003e \u003cp\u003eThe cost of living crisis has spurred demand for own label sales – they rose 13.5% year on year, with the very cheapest value lines soaring by 46%.\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eFraser McKevitt\u003c/strong\u003e, head of retail and consumer insight at \u003cstrong\u003eKantar\u003c/strong\u003e, said:\u003c/p\u003e \u003cblockquote class\u003d\"quoted\"\u003e \u003cp\u003e“The latest drop in grocery price inflation will be welcome news for shoppers but it’s too early to call the top.\u003c/p\u003e \u003cp\u003e“We’ve been here before when the rate fell at the end of 2022, only for it to rise again over the first quarter of this year.\u003c/p\u003e \u003cp\u003e“It’s important to remember, of course, that falling grocery inflation doesn’t mean lower prices, it just means prices aren’t increasing as quickly.”\u003c/p\u003e \u003c/blockquote\u003e \u003cp\u003eEaster spending still rose, with 38 million chocolate eggs and treats bought in the run-up to Easter Sunday – five million more than last year – and hot cross bun sales up 5% on last year.\u003c/p\u003e \u003c/div\u003e   \u003cp class\u003d\"block-time updated-time\"\u003eUpdated \u003ctime datetime\u003d\"2023-04-25T07:12:54.627Z\"\u003eat 8.12am BST\u003c/time\u003e\u003c/p\u003e  \u003c/div\u003e \u003cdiv id\u003d\"block-6447793e8f08155e59b78309\" class\u003d\"block\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T07:02:07.597Z\"\u003e8.02am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e    \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003e\u003cstrong\u003eNestlé’s petcare division raised its prices by 12.2% in the last quarter, helping to drive a near 16% increase in revenues.\u003c/strong\u003e\u003c/p\u003e \u003cp\u003ePrices of milk products and icecream were hiked by 11.8%, while ‘prepared dishes and cooking aids’ cost 11.1% more.\u003c/p\u003e \u003cp\u003ePetcare was the largest contributor to organic growth, led by brands such as \u003cem\u003ePurina ONE\u003c/em\u003e, \u003cem\u003ePurina Pro Plan\u003c/em\u003e and \u003cem\u003eFriskies, \u003c/em\u003efollowed by confectionery.\u003c/p\u003e  \u003cfigure class\u003d\"element element-image\" data-media-id\u003d\"8376b925f0b660207ead1425c494c55c4fe89149\"\u003e \u003cimg src\u003d\"https://media.guim.co.uk/8376b925f0b660207ead1425c494c55c4fe89149/0_0_1004_501/1000.jpg\" alt\u003d\"Nestle sales Q1 2023\" width\u003d\"1000\" height\u003d\"499\" class\u003d\"gu-image\" /\u003e \u003c/figure\u003e \u003c/div\u003e   \u003cp class\u003d\"block-time updated-time\"\u003eUpdated \u003ctime datetime\u003d\"2023-04-25T07:02:58.772Z\"\u003eat 8.02am BST\u003c/time\u003e\u003c/p\u003e  \u003c/div\u003e \u003cdiv id\u003d\"block-64476a8f8f087731d3ccd3d0\" class\u003d\"block is-key-event\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T06:53:12.882Z\"\u003e7.53am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e   \u003ch2 class\u003d\"block-title\"\u003eIntroduction: Sharp price hikes drive up Nestlé sales\u003c/h2\u003e  \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003e\u003cstrong\u003eGood morning, and welcome to our rolling coverage of business, the financial markets and the world economy.\u003c/strong\u003e\u003c/p\u003e \u003cp\u003eFood giant \u003cstrong\u003eNestlé\u003c/strong\u003e has reignited the debate over greedflation by beating sales forecasts this morning, thanks to price increases.\u003c/p\u003e \u003cp\u003eThe Swiss company behind Nespresso pods, KitKat chocolate bars and Maggi noodles says it hiked its prices by 9.8% in the first three months of this year, which it blamed on “significant cost inflation”.\u003c/p\u003e \u003cp\u003eTotal reported sales increased by 5.6%, while sales volumes edged down by 0.5% as customers largely swallowed high prices in the shops.\u003c/p\u003e \u003cp\u003eThis left \u003cstrong\u003eNestlé\u003c/strong\u003e with organic revenue growth of 9.3%, higher than expected, with sales rising to 23.5bn Swiss francs, beating average estimate of 23.27bn.\u003c/p\u003e  \u003cfigure class\u003d\"element element-tweet\" data-canonical-url\u003d\"https://twitter.com/smartkarma/status/1650731191018954752\"\u003e  \u003cblockquote class\u003d\"twitter-tweet\"\u003e\u003cp lang\u003d\"en\" dir\u003d\"ltr\"\u003e🚨 \u003ca href\u003d\"https://twitter.com/search?q\u003d%24NESN.SW\u0026amp;src\u003dctag\u0026amp;ref_src\u003dtwsrc%5Etfw\"\u003e$NESN.SW\u003c/a\u003e Nestle 1Q Organic Revenue Beats Estimates:\u003cbr\u003e∙ Organic revenue +9.3%, est +7.25% (Cons)\u003cbr\u003e∙ Pricing +9.8%, est +9.51%\u003cbr\u003e∙ Real internal growth -0.5%, est -2% \u003ca href\u003d\"https://t.co/0s1LENPdTL\"\u003ehttps://t.co/0s1LENPdTL\u003c/a\u003e\u003c/p\u003e\u0026mdash; Smartkarma (@smartkarma) \u003ca href\u003d\"https://twitter.com/smartkarma/status/1650731191018954752?ref_src\u003dtwsrc%5Etfw\"\u003eApril 25, 2023\u003c/a\u003e\u003c/blockquote\u003e \u003c/figure\u003e  \u003cp\u003e\u003cstrong\u003eMark Schneider\u003c/strong\u003e, \u003cstrong\u003eNestlé\u003c/strong\u003e CEO, says “responsible pricing” helped pump up sales growth:\u003c/p\u003e \u003cblockquote class\u003d\"quoted\"\u003e \u003cp\u003e“Nestlé delivered strong organic growth in the first quarter, as our teams worked diligently to protect volume and ensure resilient mix.\u003c/p\u003e \u003cp\u003ePortfolio optimization efforts and responsible pricing helped to offset the ongoing pressures from two years of cost inflation.\u003c/p\u003e \u003c/blockquote\u003e  \u003cfigure class\u003d\"element element-tweet\" data-canonical-url\u003d\"https://twitter.com/ReutersBiz/status/1650746551294210048\"\u003e  \u003cblockquote class\u003d\"twitter-tweet\"\u003e\u003cp lang\u003d\"en\" dir\u003d\"ltr\"\u003eNestle reported slightly better-than-expected first-quarter sales as the world\u0026#39;s biggest packaged food company hiked prices to offset its tepid sales volume. More here: \u003ca href\u003d\"https://t.co/ahjVYZ1MPP\"\u003ehttps://t.co/ahjVYZ1MPP\u003c/a\u003e \u003ca href\u003d\"https://t.co/bpYsblXh4f\"\u003epic.twitter.com/bpYsblXh4f\u003c/a\u003e\u003c/p\u003e\u0026mdash; Reuters Business (@ReutersBiz) \u003ca href\u003d\"https://twitter.com/ReutersBiz/status/1650746551294210048?ref_src\u003dtwsrc%5Etfw\"\u003eApril 25, 2023\u003c/a\u003e\u003c/blockquote\u003e \u003c/figure\u003e  \u003cp\u003eUK households, who are facing the worst food price inflation in 45 years, may question how responsible these price increases are. Central bankers, worried that company price rises are driving up inflation, may have concerns too.\u003c/p\u003e \u003caside class\u003d\"element element-rich-link element--thumbnail\"\u003e \u003cp\u003e \u003cspan\u003eRelated: \u003c/span\u003e\u003ca href\u003d\"https://www.theguardian.com/commentisfree/2023/apr/19/wage-price-inflation-greedflation-pay-cost-of-living\"\u003eThis isn’t wage-price inflation, it’s greedflation – and big companies are to blame | Larry Elliott\u003c/a\u003e \u003c/p\u003e \u003c/aside\u003e  \u003cp\u003e\u003cstrong\u003eBut there are hopes this morning that grocery inflation may have peaked.\u003c/strong\u003e\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eKantar\u003c/strong\u003e, the data research group, is expected to report this morning that the pace of price increases at UK supermarkets slowed this month.\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eKantar’s Fraser McKevitt\u003c/strong\u003e told Radio 4’s Today programme that grocery inflation dropped to 17.3% per year in the last four weeks, down from \u003ca href\u003d\"https://www.theguardian.com/business/2023/mar/28/uk-supermarket-inflation-record-high-bargains-prices\"\u003e17.5% a month ago\u003c/a\u003e.\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eMcKevitt\u003c/strong\u003e calls it a “marginal drop”, and cautions that it’s probably a bit early to say we’ve seen the peak in grocery inflation.\u003c/p\u003e \u003cp\u003eBut after 10 months of double-digit grocery price inflation, the UK is starting to lap last year’s price rises, so it’s likely that inflation (which compares prices to a year ago) will come down, he predicted.\u003c/p\u003e \u003cp\u003eBut, we won’t be entering an era of falling prices, he adds, even if prices rise less quickly than before…..\u003c/p\u003e \u003ch2\u003eThe agenda\u003c/h2\u003e \u003cul\u003e \u003cli\u003e\u003cp\u003e7am BST: UK public finances for March\u003c/p\u003e\u003c/li\u003e \u003cli\u003e\u003cp\u003e8am BST: Kantar grocery market share and inflation data\u003c/p\u003e\u003c/li\u003e \u003cli\u003e\u003cp\u003e10am BST: Bank of England deputy governor Ben Broadbent speech: ‘Monetary policy: prices versus quantities’\u003c/p\u003e\u003c/li\u003e \u003cli\u003e\u003cp\u003e11am BST: NatWest bank holds AGM\u003c/p\u003e\u003c/li\u003e \u003cli\u003e\u003cp\u003e11am BST: CBI industrial trends report\u003c/p\u003e\u003c/li\u003e \u003cli\u003e\u003cp\u003e2pm BST: US house price index\u003c/p\u003e\u003c/li\u003e \u003cli\u003e\u003cp\u003e3pm BST: US consumer confidence figures\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e \u003c/div\u003e   \u003cp class\u003d\"block-time updated-time\"\u003eUpdated \u003ctime datetime\u003d\"2023-04-25T07:32:10.616Z\"\u003eat 8.32am BST\u003c/time\u003e\u003c/p\u003e  \u003c/div\u003e"}