{"id":"world/live/2023/apr/25/russia-ukraine-war-live-risk-of-conflict-between-major-powers-at-historic-high-says-un-chief","title":"Russia-Ukraine war live: Ukrainian forces ‘conducting raids’ across Dnieper River","body":"\u003cdiv id\u003d\"block-6447a9498f08e51b9c9ffcad\" class\u003d\"block\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T10:33:32.092Z\"\u003e11.33am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e    \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003e\u003cstrong\u003eA proposal by U.N. chief Antonio Guterres on improving and extending a deal on the safe Black Sea export of Ukrainian grain can succeed only if the international community collectively pressures Russia,\u003c/strong\u003e a senior Ukrainian official said on Tuesday.\u003c/p\u003e \u003cp\u003eGuterres, the U.N. secretary-general, set out proposals for a “way forward aimed at the improvement, extension and expansion” of the agreement in a letter to Russian President Vladimir Putin.\u003c/p\u003e \u003cp\u003eIn comments to Reuters, Ukrainian presidential adviser \u003cstrong\u003eMykhailo Podolyak\u003c/strong\u003e wrote:\u003c/p\u003e \u003cblockquote class\u003d\"quoted\"\u003e \u003cp\u003eGuterres’ absolutely justified initiative can succeed only if the international community collectively pressures Russia…Ukraine, on the other hand, will continue to follow the agreements with Turkey and the U.N. and will continue to deliver grain cargoes to their destination, solving the problem of global food supply.\u003c/p\u003e \u003c/blockquote\u003e \u003cp\u003eThe Kremlin said on Tuesday that a global shortfall in food supplies was not primarily attributable to a lack of Russian and Ukrainian grain on the market. It also restated its position that provisions relating to Russian grain exports had not been properly implemented.\u003c/p\u003e \u003cp\u003ePodolyak also denied an assertion by Russia’s defence ministry that Kyiv was trying to attack its ships in the Black Sea, actions which it said threatened prospects for the extension of the grain export deal.\u003c/p\u003e \u003c/div\u003e   \u003c/div\u003e \u003cdiv id\u003d\"block-6447a74b8f08e51b9c9ffc8e\" class\u003d\"block\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T10:19:23.551Z\"\u003e11.19am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e    \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003e\u003cstrong\u003eThe Black Sea grain deal is not working for Moscow, the Kremlin reaffirmed on Tuesday, a day after the head of the United Nations handed Russia a letter with proposals to improve and expand it.\u003c/strong\u003e\u003c/p\u003e \u003cp\u003eAccording to Reuters, Kremlin spokesman Dmitry Peskov told reporters:\u003c/p\u003e \u003cblockquote class\u003d\"quoted\"\u003e \u003cp\u003eDespite the fact that so much time has passed, (the deal) has not yet been implemented, it has not come together as a package, the conditions that concerned us have still not been realised…therefore, while the circumstances don’t add up in favour of this deal, we continue to observe.\u003c/p\u003e \u003c/blockquote\u003e \u003cp\u003eThe deal was brokered by Turkey and the United Nations last July to allow Kyiv to resume grain exports from its Black Sea ports that had been severed after Russia invaded Ukraine five months earlier.\u003c/p\u003e \u003cp\u003eRussia has signalled that it will not allow the deal to be extended beyond May 18 unless obstacles to its own food and fertiliser exports are removed.\u003c/p\u003e \u003cp\u003eOn Monday, a U.N. spokesperson said United Nations Secretary-General Antonio Guterres had proposed to Russian President Vladimir Putin a “way forward aimed at the improvement, extension and expansion” of the agreement.\u003c/p\u003e \u003cp\u003eThe proposal was outlined in a letter that Guterres asked Russian Foreign Minister Sergei Lavrov to deliver to Putin.\u003c/p\u003e \u003c/div\u003e   \u003c/div\u003e \u003cdiv id\u003d\"block-6447a5df8f084a2f5d00fd77\" class\u003d\"block\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T10:11:20.644Z\"\u003e11.11am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e    \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003eHere are the latest images from Ukraine and elsewhere:\u003c/p\u003e  \u003cfigure class\u003d\"element element-image\" data-media-id\u003d\"397238216b81c087e90f365ab0080923427f092f\"\u003e \u003cimg src\u003d\"https://media.guim.co.uk/397238216b81c087e90f365ab0080923427f092f/0_275_8256_4954/1000.jpg\" alt\u003d\"Ukrainian soldiers are seen at their artillery position on Donetsk’s frontline.\" width\u003d\"1000\" height\u003d\"600\" class\u003d\"gu-image\" /\u003e \u003cfigcaption\u003e \u003cspan class\u003d\"element-image__caption\"\u003eUkrainian soldiers are seen at their artillery position on Donetsk’s frontline.\u003c/span\u003e \u003cspan class\u003d\"element-image__credit\"\u003ePhotograph: Anadolu Agency/Getty Images\u003c/span\u003e \u003c/figcaption\u003e \u003c/figure\u003e  \u003cfigure class\u003d\"element element-image\" data-media-id\u003d\"24fa7efbdae6d192068cc0e5bcebb06e128d9735\"\u003e \u003cimg src\u003d\"https://media.guim.co.uk/24fa7efbdae6d192068cc0e5bcebb06e128d9735/0_499_7532_4522/1000.jpg\" alt\u003d\"Grad missile is launched on the Donetsk frontline.\" width\u003d\"1000\" height\u003d\"600\" class\u003d\"gu-image\" /\u003e \u003cfigcaption\u003e \u003cspan class\u003d\"element-image__caption\"\u003eGrad missile is launched on the Donetsk frontline.\u003c/span\u003e \u003cspan class\u003d\"element-image__credit\"\u003ePhotograph: Anadolu Agency/Getty Images\u003c/span\u003e \u003c/figcaption\u003e \u003c/figure\u003e  \u003cfigure class\u003d\"element element-image\" data-media-id\u003d\"5dfdcdc9579ce2ad392e0df0da502bfaf31cd0c1\"\u003e \u003cimg src\u003d\"https://media.guim.co.uk/5dfdcdc9579ce2ad392e0df0da502bfaf31cd0c1/0_166_5000_3002/1000.jpg\" alt\u003d\"Ukrainian soldiers of the 80th brigade at their artillery position.\" width\u003d\"1000\" height\u003d\"600\" class\u003d\"gu-image\" /\u003e \u003cfigcaption\u003e \u003cspan class\u003d\"element-image__caption\"\u003eUkrainian soldiers of the 80th brigade at their artillery position.\u003c/span\u003e \u003cspan class\u003d\"element-image__credit\"\u003ePhotograph: Anadolu Agency/Getty Images\u003c/span\u003e \u003c/figcaption\u003e \u003c/figure\u003e  \u003cfigure class\u003d\"element element-image\" data-media-id\u003d\"732fe74bc7c22adb670f4cb05f3078ed0a6d9f65\"\u003e \u003cimg src\u003d\"https://media.guim.co.uk/732fe74bc7c22adb670f4cb05f3078ed0a6d9f65/0_131_8192_4918/1000.jpg\" alt\u003d\"A makeshift memorial to war victims and a tribute to the Ukrainian President Volodymyr Zelensky is seen outside the Russian embassy in Berlin.\" width\u003d\"1000\" height\u003d\"600\" class\u003d\"gu-image\" /\u003e \u003cfigcaption\u003e \u003cspan class\u003d\"element-image__caption\"\u003eA makeshift memorial to war victims and a tribute to the Ukrainian President Volodymyr Zelensky is seen outside the Russian embassy in Berlin.\u003c/span\u003e \u003cspan class\u003d\"element-image__credit\"\u003ePhotograph: Odd Andersen/AFP/Getty Images\u003c/span\u003e \u003c/figcaption\u003e \u003c/figure\u003e  \u003cfigure class\u003d\"element element-image\" data-media-id\u003d\"af7cd6fa74aacf7309faec10f27711570ed8f57c\"\u003e \u003cimg src\u003d\"https://media.guim.co.uk/af7cd6fa74aacf7309faec10f27711570ed8f57c/0_247_7397_4441/1000.jpg\" alt\u003d\"Children sit on a destroyed Russian military vehicle on display in Mykhailivskyi Square.\" width\u003d\"1000\" height\u003d\"600\" class\u003d\"gu-image\" /\u003e \u003cfigcaption\u003e \u003cspan class\u003d\"element-image__caption\"\u003eChildren sit on a destroyed Russian military vehicle on display in Mykhailivskyi Square.\u003c/span\u003e \u003cspan class\u003d\"element-image__credit\"\u003ePhotograph: Roman Pilipey/Getty Images\u003c/span\u003e \u003c/figcaption\u003e \u003c/figure\u003e  \u003cfigure class\u003d\"element element-image\" data-media-id\u003d\"fe496c86a2d94959e74c2a2129e49e0efd5c283c\"\u003e \u003cimg src\u003d\"https://media.guim.co.uk/fe496c86a2d94959e74c2a2129e49e0efd5c283c/0_262_7866_4722/1000.jpg\" alt\u003d\"People visit a pedestrian bridge overlooking the Dnipro River.\" width\u003d\"1000\" height\u003d\"600\" class\u003d\"gu-image\" /\u003e \u003cfigcaption\u003e \u003cspan class\u003d\"element-image__caption\"\u003ePeople visit a pedestrian bridge overlooking the Dnipro River.\u003c/span\u003e \u003cspan class\u003d\"element-image__credit\"\u003ePhotograph: Roman Pilipey/Getty Images\u003c/span\u003e \u003c/figcaption\u003e \u003c/figure\u003e \u003c/div\u003e   \u003cp class\u003d\"block-time updated-time\"\u003eUpdated \u003ctime datetime\u003d\"2023-04-25T10:13:04.511Z\"\u003eat 11.13am BST\u003c/time\u003e\u003c/p\u003e  \u003c/div\u003e \u003cdiv id\u003d\"block-6447a0f48f0802b5b51dda74\" class\u003d\"block is-summary\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T10:00:53.830Z\"\u003e11.00am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e   \u003ch2 class\u003d\"block-title\"\u003eSummary of the day so far …\u003c/h2\u003e  \u003cdiv class\u003d\"block-elements\"\u003e  \u003cul\u003e \u003cli\u003e\u003cp\u003e\u003cstrong\u003eUkrainian forces based on the western side of the Dnieper River are frequently carrying out raids on the eastern bank near the city of Kherson to try to dislodge Russian troops, a regional official said on Tuesday. Yuriy Sobolevskiy\u003c/strong\u003e, deputy head of the Kherson regional administration, said the raids were intended to reduce the combat capability of Russian troops who have been shelling Kherson city since being forced to retreat. “Our military visit the left (eastern) bank very often, conducting raids. The Ukrainian armed forces are working, and working very effectively,” Sobolevskiy told Ukrainian television.\u003c/p\u003e\u003c/li\u003e \u003cli\u003e\u003cp\u003e\u003cstrong\u003eOne person has been killed and ten wounded in a strike on a museum in Kupyansk in Kharkiv region.\u003c/strong\u003e Ukraine’s President \u003cstrong\u003eVolodymyr Zelenskiy\u003c/strong\u003e said “The terrorist country is doing everything to destroy us completely. Our history, our culture, our people. Killing Ukrainians with absolutely barbaric methods.”\u003c/p\u003e\u003c/li\u003e \u003cli\u003e\u003cp\u003e\u003cstrong\u003eOleh Synyehubov\u003c/strong\u003e, governor of \u003cstrong\u003eKharkiv\u003c/strong\u003e, said “Rescue operations are ongoing at the site of the rocket attack in the center of Kupyansk. Unfortunately, the woman who was under the rubble died. Rescuers have just recovered her body. According to our information, one more person may be under the rubble. Special services are doing everything possible to find her. There are no military facilities near the museum building, which was hit by an enemy S-300 missile. The enemy is deliberately hitting civilian infrastructure and terrorizing the civilian population.”\u003c/p\u003e\u003c/li\u003e \u003cli\u003e\u003cp\u003e\u003cstrong\u003eThe number of daily casualties Russia is suffering has fallen by about 30% in April, UK intelligence has said. \u003c/strong\u003eIn its daily intelligence briefing, the Ministry of Defence reported that the drop was probably due to the end of Russia’s winter offensive, which, it added, had largely failed. The MoD also said Russia was now likely to be preparing its troops for Ukraine’s counteroffensive.\u003c/p\u003e\u003c/li\u003e \u003cli\u003e\u003cp\u003e\u003cstrong\u003eRussia’s foreign ministry has said it is expelling a Moldovan diplomat in what it cast as retaliation for the expulsion last week of a Russian diplomat in Moldova.\u003c/strong\u003e The ministry said in a statement it had summoned Moldova’s ambassador in Moscow to announce the expulsion, as well as to protest against what it called “unfriendly steps towards Russia” and “regular anti-Russian statements” from Chișinău.\u003c/p\u003e\u003c/li\u003e \u003cli\u003e\u003cp\u003e\u003cstrong\u003eLithuania’s parliament voted on Tuesday in favour of allowing border guards to turn back migrants who illegally entered the country.\u003c/strong\u003e Lithuania borders fellow EU states Latvia and Poland, as well as Belarus, and the Russian exclave of Kaliningrad. In 2021, Latvia declared a state of emergency and Lithuania began planning a razor-wire fence to stop record numbers of migrants crossing their borders from Belarus. Authorities in the two Baltic states and Poland accused the Belarusian leader, Alexander Lukashenko, of orchestrating the crossings in a form of “hybrid warfare”.\u003c/p\u003e\u003c/li\u003e \u003cli\u003e\u003cp\u003e\u003cstrong\u003eUkraine\u003c/strong\u003e has rescued 138 civilians, including its own nationals and citizens of \u003cstrong\u003eGeorgia\u003c/strong\u003e and \u003cstrong\u003ePeru\u003c/strong\u003e, who were trapped by fighting in \u003cstrong\u003eSudan\u003c/strong\u003e, Ukraine’s military intelligence said.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e \u003cp\u003e\u003cem\u003eThat is it from me, Martin Belam, for now. I will be back later. Geneva Abdul will be here shortly to take you through the next few hours of our live coverage. We also have \u003ca href\u003d\"https://www.theguardian.com/world/live/2023/apr/25/sudan-live-uk-government-coordinating-evacuation-of-british-nationals\"\u003elive coverage of the Sudan crisis\u003c/a\u003e with Harry Taylor.\u003c/em\u003e\u003c/p\u003e \u003c/div\u003e   \u003c/div\u003e \u003cdiv id\u003d\"block-6447989e8f086890899d96e0\" class\u003d\"block\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T09:13:00.514Z\"\u003e10.13am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e    \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003e\u003cstrong\u003eOleh Synyehubov\u003c/strong\u003e, the governor of \u003cstrong\u003eKharkiv\u003c/strong\u003e, has appeared on television in Ukraine and given an update via Telegram on the situation in \u003cstrong\u003eKupyansk\u003c/strong\u003e after the strike on the museum earlier today. He posted:\u003c/p\u003e \u003cblockquote class\u003d\"quoted\"\u003e \u003cp\u003eRescue operations are ongoing at the site of the rocket attack in the center of Kupyansk. Unfortunately, the woman who was under the rubble died. Rescuers have just recovered her body. According to our information, one more person may be under the rubble. Special services are doing everything possible to find her.\u003c/p\u003e \u003cp\u003eThere are no military facilities near the museum building, which was hit by an enemy S-300 missile. The enemy is deliberately hitting civilian infrastructure and terrorizing the civilian population.\u003c/p\u003e \u003cp\u003eWork on identifying collaborators is ongoing in the region. Currently, prosecutor’s offices manage more than 1,000 such cases. Some of them have already been brought to court. Anyone found guilty of collaborating with the enemy will receive a just punishment.\u003c/p\u003e \u003c/blockquote\u003e \u003cp\u003eRussia has repeatedly denied targeting civilians and civilian infrastructure in Ukraine. Since February 2022, the UN has recorded 6,596 civilians killed and 11,684 injured in territory controlled by the Ukrainian government.\u003c/p\u003e \u003c/div\u003e   \u003cp class\u003d\"block-time updated-time\"\u003eUpdated \u003ctime datetime\u003d\"2023-04-25T09:35:23.651Z\"\u003eat 10.35am BST\u003c/time\u003e\u003c/p\u003e  \u003c/div\u003e \u003cdiv id\u003d\"block-644797e68f086890899d96db\" class\u003d\"block\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T09:06:36.441Z\"\u003e10.06am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e    \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003eSuspilne, Ukraine\u0027s state broadcaster, is reporting that its correspondents have heard explosions in \u003cstrong\u003eKherson\u003c/strong\u003e.\u003c/p\u003e \u003c/div\u003e   \u003c/div\u003e \u003cdiv id\u003d\"block-644794be8f087731d3ccd510\" class\u003d\"block is-key-event\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T08:57:06.634Z\"\u003e9.57am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e   \u003ch2 class\u003d\"block-title\"\u003eKherson official: Ukrainian forces \u0027conducting raids\u0027 across Dnieper River \u0027very often\u0027\u003c/h2\u003e  \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003e\u003cstrong\u003eUkrainian forces based on the western side of the Dnieper River are frequently carrying out raids on the eastern bank near the city of Kherson to try to dislodge Russian troops, a regional official said on Tuesday.\u003c/strong\u003e\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eYuriy Sobolevskiy\u003c/strong\u003e, the deputy head of the Kherson regional administration, said the raids were intended to reduce the combat capability of Russian troops who have been shelling Kherson city since being forced to retreat. “Our military visit the left (eastern) bank very often, conducting raids. The Ukrainian armed forces are working, and working very effectively,” Sobolevskiy told Ukrainian television.\u003c/p\u003e \u003cp\u003e“The results will come as they did on the right bank of the Kherson region when, thanks to a complex and long operation, they were able to liberate our territories with minimal losses for our military. The same thing happens now on the left bank.”\u003c/p\u003e \u003cp\u003eRussian forces have held the eastern side of the Dnieper River near Kherson since retreating from the southern city in November after months of occupation, but Ukraine is expected to launch a spring counteroffensive to try to recapture more territory. Kherson is one of the partially occupied regions of Ukraine which the Russian Federation claims to have annexed.\u003c/p\u003e \u003cp\u003eSobolevskiy gave no further details, saying a military operation requires “informational silence”.\u003c/p\u003e \u003c/div\u003e   \u003cp class\u003d\"block-time updated-time\"\u003eUpdated \u003ctime datetime\u003d\"2023-04-25T09:35:41.282Z\"\u003eat 10.35am BST\u003c/time\u003e\u003c/p\u003e  \u003c/div\u003e \u003cdiv id\u003d\"block-644790158f086890899d969f\" class\u003d\"block\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T08:35:36.432Z\"\u003e9.35am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e    \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003e\u003cstrong\u003eLithuania’s parliament voted on Tuesday in favour of allowing border guards to turn back migrants who illegally entered the country, a tally of votes showed, Reuters reports.\u003c/strong\u003e\u003c/p\u003e \u003cp\u003eLithuania borders fellow EU states Latvia and Poland, as well as Belarus, and the Russian exclave of Kaliningrad.\u003c/p\u003e \u003cp\u003eIn 2021, Latvia declared a state of emergency and Lithuania began planning a razor-wire fence to stop record numbers of migrants crossing their borders from Belarus, amid claims Minsk was using the arrivals as leverage on EU states to reverse sanctions.\u003c/p\u003e \u003cp\u003eAuthorities in the two Baltic states and Poland accused the Belarusian leader, Alexander Lukashenko, of orchestrating the crossings in a form of “hybrid warfare”.\u003c/p\u003e \u003c/div\u003e   \u003c/div\u003e \u003cdiv id\u003d\"block-64478f528f086890899d9698\" class\u003d\"block is-key-event\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T08:30:32.706Z\"\u003e9.30am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e   \u003ch2 class\u003d\"block-title\"\u003eUkraine says it has rescued 138 civilians from Sudan\u003c/h2\u003e  \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003e\u003cstrong\u003eUkraine has rescued 138 civilians, including its own nationals and citizens of Georgia and Peru, who were trapped by fighting in Sudan, Ukraine’s military intelligence said on Tuesday.\u003c/strong\u003e\u003c/p\u003e \u003cp\u003eReuters reports the GUR military intelligence agency said that it had evacuated 87 citizens of Ukraine, who were mostly aviation specialists – pilots and technicians – and members of their families.\u003c/p\u003e \u003cp\u003e“Citizens of Georgia and Peru were also evacuated. A total of 138 citizens were saved. Among them are 35 women and 12 children,” it said on Telegram app.\u003c/p\u003e \u003cp\u003eThe evacuees were now in Egypt and receiving medical help, food, and water, the agency aid.\u003c/p\u003e \u003c/div\u003e   \u003cp class\u003d\"block-time updated-time\"\u003eUpdated \u003ctime datetime\u003d\"2023-04-25T08:30:41.767Z\"\u003eat 9.30am BST\u003c/time\u003e\u003c/p\u003e  \u003c/div\u003e \u003cdiv id\u003d\"block-64478c658f08155e59b78393\" class\u003d\"block\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T08:20:23.658Z\"\u003e9.20am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e    \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003e\u003cstrong\u003eRussia’s foreign ministry has said it is expelling a Moldovan diplomat in what it cast as retaliation for the expulsion last week of a Russian diplomat in Moldova.\u003c/strong\u003e\u003c/p\u003e \u003cp\u003eThe ministry said in a statement it had summoned Moldova’s ambassador in Moscow to announce the expulsion, as well as to protest against what it called “unfriendly steps towards Russia” and “regular anti-Russian statements” from Chișinău.\u003c/p\u003e \u003c/div\u003e   \u003c/div\u003e \u003cdiv id\u003d\"block-644789aa8f087731d3ccd4b5\" class\u003d\"block\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T08:05:52.316Z\"\u003e9.05am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e    \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003e\u003cstrong\u003ePope Francis leaves on Friday on a three-day trip to Hungary, where the war in Ukraine, migration and Europe’s Christian roots are expected to top the agenda in his public addresses and private talks with nationalist prime minister Viktor Orbán.\u003c/strong\u003e\u003c/p\u003e \u003cp\u003eReuters reports that while its main purpose is meeting Hungarian Catholics, Francis acknowledged on Sunday that its content is affected by current events.\u003c/p\u003e \u003cp\u003e“It also will be a trip to the centre of Europe, which continues to be battered by frigid winds of war, while the movement of so many people has put urgent humanitarian issues on the agenda,” he said.\u003c/p\u003e \u003cp\u003eOrbán has said Hungary and the Vatican are the only two European states that can be described as “pro-peace” regarding Ukraine.\u003c/p\u003e \u003cp\u003eBoth Orbán 59, and the pope, 86, have called for a ceasefire and negotiations to end the war and Francis has urged Ukraine to be open to dialogue with “aggressor” Russia, something Ukraine so far has ruled out.\u003c/p\u003e \u003cp\u003eHungary, which supports a sovereign Ukraine but still has strong economic ties to Russia, has refused to send weapons to Ukraine.\u003c/p\u003e \u003c/div\u003e   \u003c/div\u003e \u003cdiv id\u003d\"block-64474b038f087731d3ccd33a\" class\u003d\"block\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T07:42:11.042Z\"\u003e8.42am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e    \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003eRisks of a direct military confrontation between the two nuclear powers, Russia and the United States, are steadily growing, the TASS news agency quoted a senior Russian diplomat as saying on Tuesday.\u003c/p\u003e \u003cp\u003eVladimir Yermakov, the foreign ministry’s head of nuclear non-proliferation, told the Russian state news agency that Washington is escalating the risks through its conduct with Moscow.\u003c/p\u003e \u003cp\u003eSince the start of its invasion on Ukraine 14 months ago, Moscow has issued regular charges against the US and what it calls “the collective West” for raising the risks of a nuclear war, rhetoric intended to deter Kyiv’s allies.\u003c/p\u003e \u003cp\u003eYermakov said:\u003c/p\u003e \u003cblockquote class\u003d\"quoted\"\u003e \u003cp\u003eIf the United States continues to follow its current course of confrontation with Russia, with the stakes constantly escalating on the verge of sliding into direct armed conflict, then the fate of START (nuclear arms treaty) may be a foregone conclusion.\u003c/p\u003e \u003c/blockquote\u003e \u003cp\u003eThe US told Russia in March that it will cease exchanging some data on its nuclear forces following Moscow’s refusal to do so, calling it a response to Russia’s suspending participation in the New START treaty.\u003c/p\u003e \u003cp\u003eYermakov did not provide details of the alleged US confrontational approach in the excerpts from the TASS interview published so far.\u003c/p\u003e \u003cp\u003eYermakov added:\u003c/p\u003e \u003cblockquote class\u003d\"quoted\"\u003e \u003cp\u003eThe most acute threat today is associated ... with the danger of nuclear escalation as a result of a direct military confrontation between nuclear powers. And these risks, to the deepest regret, are steadily growing.\u003c/p\u003e \u003c/blockquote\u003e \u003cp\u003eMoscow and Beijing will assess the West’s potential involvement in the global expansion of the US anti-missile system, which “clearly undermines strategic stability,” he added\u003c/p\u003e \u003c/div\u003e   \u003c/div\u003e \u003cdiv id\u003d\"block-644780ca8f086890899d962c\" class\u003d\"block\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T07:30:05.386Z\"\u003e8.30am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e    \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003eHere are some of the latest images from Ukraine coming through from news agencies:\u003c/p\u003e  \u003cfigure class\u003d\"element element-image\" data-media-id\u003d\"21463b5d3e0b92b9dfa641adb1b4502801351f50\"\u003e \u003cimg src\u003d\"https://media.guim.co.uk/21463b5d3e0b92b9dfa641adb1b4502801351f50/0_128_5472_3283/1000.jpg\" alt\u003d\"A Ukrainian soldier in a shelter at a front line near the city of Bakhmut.\" width\u003d\"1000\" height\u003d\"600\" class\u003d\"gu-image\" /\u003e \u003cfigcaption\u003e \u003cspan class\u003d\"element-image__caption\"\u003eA Ukrainian soldier in a shelter at a front line near the city of Bakhmut.\u003c/span\u003e \u003cspan class\u003d\"element-image__credit\"\u003ePhotograph: Reuters\u003c/span\u003e \u003c/figcaption\u003e \u003c/figure\u003e  \u003cfigure class\u003d\"element element-image\" data-media-id\u003d\"bacf0cf199f6d87b791598842e9613810a069d97\"\u003e \u003cimg src\u003d\"https://media.guim.co.uk/bacf0cf199f6d87b791598842e9613810a069d97/0_157_8256_4954/1000.jpg\" alt\u003d\"A Ukrainian woman in her wrecked house in the village of Bohorodychne.\" width\u003d\"1000\" height\u003d\"600\" class\u003d\"gu-image\" /\u003e \u003cfigcaption\u003e \u003cspan class\u003d\"element-image__caption\"\u003eA Ukrainian woman in her wrecked house in the village of Bohorodychne.\u003c/span\u003e \u003cspan class\u003d\"element-image__credit\"\u003ePhotograph: Scott Peterson/Getty Images\u003c/span\u003e \u003c/figcaption\u003e \u003c/figure\u003e  \u003cfigure class\u003d\"element element-image\" data-media-id\u003d\"d2f07b7d0945f2b97a14dadac8c0fb7e5409b454\"\u003e \u003cimg src\u003d\"https://media.guim.co.uk/d2f07b7d0945f2b97a14dadac8c0fb7e5409b454/0_0_5472_3283/1000.jpg\" alt\u003d\"A Ukrainian soldier fires a howitzer D30 at a front line near the city of Bakhmut.\" width\u003d\"1000\" height\u003d\"600\" class\u003d\"gu-image\" /\u003e \u003cfigcaption\u003e \u003cspan class\u003d\"element-image__caption\"\u003eA Ukrainian soldier fires a howitzer D30 at a front line near the city of Bakhmut.\u003c/span\u003e \u003cspan class\u003d\"element-image__credit\"\u003ePhotograph: Reuters\u003c/span\u003e \u003c/figcaption\u003e \u003c/figure\u003e \u003c/div\u003e   \u003c/div\u003e \u003cdiv id\u003d\"block-64477a978f086890899d95fa\" class\u003d\"block\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T07:16:07.384Z\"\u003e8.16am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e    \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003eRussia’s foreign ministry has summoned the Moldovan ambassador in Moscow over the expulsion last week of a Russian diplomat in Moldova, state-owned news agency RIA reported.\u003c/p\u003e \u003cp\u003eLast week, Moldovan government press secretary Daniel Voda told reporters the decision to expel a Russian diplomat was connected to the actions of embassy staff towards Moldovan border guards at Chisinau airport.\u003c/p\u003e \u003cp\u003eMoldova, which applied to join the European Union last year alongside its neighbour Ukraine, has repeatedly accused Russia of trying to destabilise the country, something Moscow denies.\u003c/p\u003e \u003c/div\u003e   \u003cp class\u003d\"block-time updated-time\"\u003eUpdated \u003ctime datetime\u003d\"2023-04-25T07:16:16.554Z\"\u003eat 8.16am BST\u003c/time\u003e\u003c/p\u003e  \u003c/div\u003e \u003cdiv id\u003d\"block-64477b148f087731d3ccd453\" class\u003d\"block is-key-event\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T07:06:06.353Z\"\u003e8.06am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e   \u003ch2 class\u003d\"block-title\"\u003eOne killed, 10 wounded in strike on museum in Kupyansk\u003c/h2\u003e  \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003eUkraine’s president \u003cstrong\u003eVolodymyr Zelenskiy\u003c/strong\u003e has posted to his Telegram channel to say that one person has been killed and 10 wounded in a strike on a museum in \u003cstrong\u003eKupyansk\u003c/strong\u003e in \u003cstrong\u003eKharkiv\u003c/strong\u003e region. He writes:\u003c/p\u003e \u003cblockquote class\u003d\"quoted\"\u003e \u003cp\u003eKupyansk, city centre, local history museum. The terrorist country is doing everything to destroy us completely. Our history, our culture, our people. Killing Ukrainians with absolutely barbaric methods. We have no right to forget about it for a single second. We must and will respond!\u003c/p\u003e \u003cp\u003eSo far, it is known about a dead employee of the museum, and 10 wounded. There are still people under the rubble. Elimination of the consequences of shelling continues. All necessary services are involved.\u003c/p\u003e \u003cp\u003eEternal memory to the deceased and condolences to the relatives. All those guilty of these war crimes will definitely be brought to justice and it will be merciless.\u003c/p\u003e \u003c/blockquote\u003e \u003cp\u003eUkrainian officials are distributing on social media a video clip that purports to show the aftermath of the attack.\u003c/p\u003e  \u003cfigure class\u003d\"element element-tweet\" data-canonical-url\u003d\"https://twitter.com/Gerashchenko_en/status/1650754460505845761\"\u003e  \u003cblockquote class\u003d\"twitter-tweet\"\u003e\u003cp lang\u003d\"en\" dir\u003d\"ltr\"\u003eRussia attacked Kupiansk, Kharkiv region with S300 rockets.\u003cbr\u003e\u003cbr\u003eFive people reported wounded so far. There are people under the debris.\u003cbr\u003e\u003cbr\u003eRescue work continues.\u003ca href\u003d\"https://twitter.com/hashtag/RussiaIsATerroristState?src\u003dhash\u0026amp;ref_src\u003dtwsrc%5Etfw\"\u003e#RussiaIsATerroristState\u003c/a\u003e\u003cbr\u003e\u003cbr\u003e📹: Presidential office \u003ca href\u003d\"https://t.co/sEc8tKv2Yi\"\u003epic.twitter.com/sEc8tKv2Yi\u003c/a\u003e\u003c/p\u003e\u0026mdash; Anton Gerashchenko (@Gerashchenko_en) \u003ca href\u003d\"https://twitter.com/Gerashchenko_en/status/1650754460505845761?ref_src\u003dtwsrc%5Etfw\"\u003eApril 25, 2023\u003c/a\u003e\u003c/blockquote\u003e \u003c/figure\u003e  \u003cp\u003eThe claims have not been independently verified.\u003c/p\u003e \u003c/div\u003e   \u003cp class\u003d\"block-time updated-time\"\u003eUpdated \u003ctime datetime\u003d\"2023-04-25T07:14:23.261Z\"\u003eat 8.14am BST\u003c/time\u003e\u003c/p\u003e  \u003c/div\u003e \u003cdiv id\u003d\"block-644774218f087731d3ccd425\" class\u003d\"block is-key-event\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T06:46:01.808Z\"\u003e7.46am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e   \u003ch2 class\u003d\"block-title\"\u003eRussia\u0027s casualty rate falls as preparation for Ukraine offensive begins – UK\u003c/h2\u003e  \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003eThe number of daily casualties Russia is suffering has fallen by about 30% in April, UK intelligence has said.\u003c/p\u003e \u003cp\u003eIn its daily intelligence briefing, the Ministry of Defence reported that the drop was probably due to the end of Russia’s winter offensive, which, it added, had largely failed.\u003c/p\u003e \u003cp\u003eThe MoD also said Russia was now likely to be preparing its troops for Ukraine’s counteroffensive.\u003c/p\u003e \u003cp\u003eIt \u003ca href\u003d\"https://twitter.com/DefenceHQ/status/1650739501927395331\"\u003esaid\u003c/a\u003e:\u003c/p\u003e \u003cblockquote class\u003d\"quoted\"\u003e \u003cp\u003eOver April 2023, Russia’s average daily casualty rate has highly likely fallen by around 30 per cent. This follows exceptionally heavy Russian casualties over January-March 2023.\u003c/p\u003e \u003cp\u003eFigures released by the Ukrainian General Staff suggest a reduction from a daily average of 776 Russian casualties in March, to an average of 568 so far in April. Defence Intelligence cannot verify Ukraine’s exact methodology, but the general trend is likely accurate.\u003c/p\u003e \u003cp\u003eRussia’s losses have highly likely reduced as their attempted winter offensive has failed to achieve its objectives, and Russian forces are now focused on preparing for anticipated Ukrainian offensive operations.\u003c/p\u003e \u003c/blockquote\u003e \u003c/div\u003e   \u003cp class\u003d\"block-time updated-time\"\u003eUpdated \u003ctime datetime\u003d\"2023-04-25T07:16:39.598Z\"\u003eat 8.16am BST\u003c/time\u003e\u003c/p\u003e  \u003c/div\u003e \u003cdiv id\u003d\"block-644773388f087731d3ccd41f\" class\u003d\"block\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T06:30:40.976Z\"\u003e7.30am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e    \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003e\u003cstrong\u003eAndriy Yermak\u003c/strong\u003e, the head of the office of the Ukrainian presidency, has posted a video on Telegram that purports to show the aftermath of an attack in the \u003cstrong\u003eKharkiv\u003c/strong\u003e region. He writes:\u003c/p\u003e \u003cblockquote class\u003d\"quoted\"\u003e \u003cp\u003eThe Russians shelled the centre of the city of Kupyansk in the Kharkiv region with S-300. They hit the museum. There are people under the rubble, it is already known about more than five wounded.\u003c/p\u003e \u003c/blockquote\u003e \u003cp\u003eThe claims have not been independently verified.\u003c/p\u003e \u003c/div\u003e   \u003cp class\u003d\"block-time updated-time\"\u003eUpdated \u003ctime datetime\u003d\"2023-04-25T06:44:37.822Z\"\u003eat 7.44am BST\u003c/time\u003e\u003c/p\u003e  \u003c/div\u003e \u003cdiv id\u003d\"block-644753718f087731d3ccd36a\" class\u003d\"block\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T06:23:46.049Z\"\u003e7.23am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e    \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003eThe Russian foreign minister has strongly criticised Nato members’ activities in the western Pacific, specifically the alliance between Australia, Britain and the US, and also strengthening US ties with Japan, South Korea and a number of south-east Asian countries.\u003c/p\u003e \u003cp\u003eSergei Lavrov also accused the US embassy in Moscow of blocking Russian journalists from accompanying him to New York by approving their visas only after his plane left.\u003c/p\u003e \u003cp\u003eThe Russian minister stressed that multilateralism was a key part of the UN charter and accused the United States and its allies of “destroying globalization” despite touting its benefits.\u003c/p\u003e \u003cp\u003eLavrov said the west was promoting a “rules-based order” where nobody had seen the rules and which bars access to modern technologies and financial services to punish countries it disagreed with. The west had imposed a series of economic sanctions on Russia in response to the invasion of Ukraine.\u003c/p\u003e \u003cp\u003e“Let’s call a spade a spade. Nobody allowed the western minority to speak on behalf of all humankind,” he said.\u003c/p\u003e \u003cp\u003eLinda Thomas-Greenfield, the US ambassador, told the council that Russia’s actions during the 14-month war showed the invasion of Ukraine was not an isolated incident.\u003c/p\u003e \u003cp\u003e“This does not just concern Ukraine or Europe,” she said. “It concerns all of us. Because today it’s Ukraine, But tomorrow it could be another country, another small nation that is invaded by its larger neighbour.”\u003c/p\u003e \u003cp\u003eRepresentatives of about 50 countries spoke, with many pointing to the increasing confrontation among UN member states. They stressed the importance of preserving multilateralism, including by reforming the security council to reflect the 21st-century instead of the post-second world war power structure.\u003c/p\u003e \u003c/div\u003e   \u003cp class\u003d\"block-time updated-time\"\u003eUpdated \u003ctime datetime\u003d\"2023-04-25T06:49:27.433Z\"\u003eat 7.49am BST\u003c/time\u003e\u003c/p\u003e  \u003c/div\u003e \u003cdiv id\u003d\"block-64474c638f086890899d9504\" class\u003d\"block is-key-event\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T05:53:22.950Z\"\u003e6.53am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e   \u003ch2 class\u003d\"block-title\"\u003eMoscow accuses Ukraine of attempting to attack its ships on Black Sea, ‘jeopardising grain deal’\u003c/h2\u003e  \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003eRussia’s defence ministry on Monday accused Ukraine of attempting to attack its ships in the Black Sea, which it said was threatening prospects for a deal on grain exports.\u003cbr\u003e\u003cbr\u003e“The terrorist actions of the Kyiv regime jeopardize the next extension of the grain deal beyond 18 May this year,” it said in a statement on its Telegram channel.\u003cbr\u003e\u003cbr\u003eThe defense ministry said an analysis of the route taken by Ukrainian naval drones launched 23 March and 24 April showed they originated in the water area of the Crimean port of Odesa that is designated for the implementation of the Black Sea initiative.\u003cbr\u003e\u003cbr\u003eUkraine almost never publicly claims responsibility for attacks inside Russia and on Russian-controlled territory in Ukraine.\u003c/p\u003e \u003c/div\u003e   \u003c/div\u003e \u003cdiv id\u003d\"block-6447532c8f087731d3ccd366\" class\u003d\"block\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T05:36:55.900Z\"\u003e6.36am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e    \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003eMore now from the UN meeting on Monday evening, where the US ambassador Linda Thomas-Greenfield called Russia a “hypocritical convener” of the meeting whose “illegal, unprovoked and unnecessary” war in Ukraine “struck at the heart of the UN charter and all that we hold dear.”\u003c/p\u003e \u003cp\u003eBritain’s UN ambassador, Barbara Woodward, said countries had seen “what Russia’s idea of multilateralism means for the world” – the trampling of the UN charter and a war that had brought unimaginable suffering to Ukraine and been “an unmitigated disaster for Russia, too”.\u003c/p\u003e \u003cp\u003eThe 27-member European Union called Russia’s attempt to portray itself as a defender of the UN charter and multilateralism “cynical”, saying it is “in contempt” not only of the UN charter but UN general assembly resolutions demanding the withdrawal of Russian forces.\u003c/p\u003e \u003cp\u003eBut the Russian foreign minister, Sergei Lavrov, defended what Moscow calls its “special military operation”, reiterating accusations that Ukraine was promoting “Nazi practices” and banning the Russian language and culture, and Nato was planning to expand into Ukraine.\u003c/p\u003e \u003cp\u003eHe stressed, however, that “it’s not all about Ukraine” but what he called the west’s plans to leverage the Ukrainian government in the hope of weakening Russia.\u003c/p\u003e \u003cp\u003e“We cannot consider the Ukrainian issue separately from the geopolitical context,” Lavrov said. “It’s about how international relations will continue to be shaped through the establishment of a sound consensus on the basis of balance of interests, or through aggressive and volatile advancement of Washington’s hegemony.”\u003c/p\u003e \u003c/div\u003e   \u003cp class\u003d\"block-time updated-time\"\u003eUpdated \u003ctime datetime\u003d\"2023-04-25T06:50:00.582Z\"\u003eat 7.50am BST\u003c/time\u003e\u003c/p\u003e  \u003c/div\u003e \u003cdiv id\u003d\"block-6447529d8f087731d3ccd362\" class\u003d\"block\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T05:22:32.558Z\"\u003e6.22am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e    \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003eAt the meeting, the UN secretary general and the ambassadors of the US, Britain, France and their allies all pointed to the UN charter’s underlying principle requiring all countries to support the sovereignty, territorial integrity and political independence of every nation – which Russia violated by invading Ukraine and illegally annexing several regions.\u003c/p\u003e  \u003cfigure class\u003d\"element element-image\" data-media-id\u003d\"0568d00723f05e3ddd18173afc65487cde949fa3\"\u003e \u003cimg src\u003d\"https://media.guim.co.uk/0568d00723f05e3ddd18173afc65487cde949fa3/0_0_3000_1801/1000.jpg\" alt\u003d\"The UN permanent representative and ambassador of China, Zhang Jun, speaks during the security council meeting on maintenance of international peace and security at the UN headquarters.\" width\u003d\"1000\" height\u003d\"600\" class\u003d\"gu-image\" /\u003e \u003cfigcaption\u003e \u003cspan class\u003d\"element-image__caption\"\u003eThe UN permanent representative and ambassador of China, Zhang Jun, speaks during the security council meeting on maintenance of international peace and security at the UN headquarters.\u003c/span\u003e \u003cspan class\u003d\"element-image__credit\"\u003ePhotograph: Lev Radin/Pacific Press/Shutterstock\u003c/span\u003e \u003c/figcaption\u003e \u003c/figure\u003e  \u003cp\u003e“The world is standing at a historic crossroads now,” China’s UN ambassador, Zhang Jun, told the council.\u003c/p\u003e \u003cp\u003e“Humanity is facing unprecedented global challenges. Acts of hegemony and bullying are causing colossal harm to the world. Politics are creating huge divisions and confrontations. It has become all the more urgent and important to uphold the UN charter.”\u003c/p\u003e \u003c/div\u003e   \u003cp class\u003d\"block-time updated-time\"\u003eUpdated \u003ctime datetime\u003d\"2023-04-25T06:44:03.432Z\"\u003eat 7.44am BST\u003c/time\u003e\u003c/p\u003e  \u003c/div\u003e \u003cdiv id\u003d\"block-644751e88f087731d3ccd35d\" class\u003d\"block is-key-event\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T05:10:45.804Z\"\u003e6.10am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e   \u003ch2 class\u003d\"block-title\"\u003eRisks of conflict between major powers at ‘historic high’ says UN chief\u003c/h2\u003e  \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003eThe UN chief and representatives from western countries berated Russia’s top diplomat as he chaired a UN meeting Monday, accusing Moscow of violating the UN charter \u003ca href\u003d\"https://apnews.com/hub/russia-ukraine?utm_source\u003dapnewsnav\u0026amp;utm_medium\u003dfeatured\"\u003eby attacking Ukraine\u003c/a\u003e and occupying part of its territory.\u003c/p\u003e \u003cp\u003eThe Russian foreign minister, Sergei Lavrov, responded by defending his country’s military action and accusing the US and its allies of undercutting global diplomacy, the foundation of the United Nations, which was created to prevent a third world war.\u003c/p\u003e \u003cp\u003eThe UN secretary general, António Guterres, called cooperation among the UN’s 193-member states the organisation’s “beating heart” and “guiding vision”, and he warned the security council that global collaboration was under the greatest strain since the creation of the United Nations in 1945 on the ashes of the second world war.\u003c/p\u003e \u003cp\u003eTensions between major powers are at a “historic high” and so are the risks of conflict “through misadventure or miscalculation”, he said, pointing first and foremost to the war in Ukraine.\u003c/p\u003e \u003c/div\u003e   \u003cp class\u003d\"block-time updated-time\"\u003eUpdated \u003ctime datetime\u003d\"2023-04-25T06:43:38.974Z\"\u003eat 7.43am BST\u003c/time\u003e\u003c/p\u003e  \u003c/div\u003e \u003cdiv id\u003d\"block-64474b008f087731d3ccd339\" class\u003d\"block is-key-event\" data-block-contributor\u003d\"\"\u003e \u003cp class\u003d\"block-time published-time\"\u003e \u003ctime datetime\u003d\"2023-04-25T04:59:36.231Z\"\u003e5.59am \u003cspan class\u003d\"timezone\"\u003eBST\u003c/span\u003e\u003c/time\u003e \u003c/p\u003e   \u003ch2 class\u003d\"block-title\"\u003eOpening summary\u003c/h2\u003e  \u003cdiv class\u003d\"block-elements\"\u003e  \u003cp\u003eWelcome back to our live coverage of the war in Ukraine with me, Helen Sullivan.\u003c/p\u003e \u003cp\u003eOur top story this morning: The UN chief and representatives from western nations berated Russia’s top diplomat as he chaired a UN meeting Monday, accusing Moscow of violating the UN Charter \u003ca href\u003d\"https://apnews.com/hub/russia-ukraine?utm_source\u003dapnewsnav\u0026amp;utm_medium\u003dfeatured\"\u003eby attacking Ukraine\u003c/a\u003e and occupying part of its territory.\u003c/p\u003e \u003cp\u003eSecretary-General António Guterres warned the Security Council that global collaboration is under the greatest strain since the creation of the United Nations in 1945 on the ashes of the second world war.\u003c/p\u003e \u003cp\u003eWe’ll have more on the tense meeting shortly. In the meantime here are the other key recent developments:\u003c/p\u003e \u003cul\u003e \u003cli\u003e\u003cp\u003e\u003cstrong\u003eRussia has switched to defensive positions in all its areas of combat apart from Bakhmut, according to the Ukrainian head of intelligence, Kyrylo Budanov.\u003c/strong\u003e In an interview \u003ca href\u003d\"https://www.rbc.ua/rus/news/kirilo-budanov-viyti-kordoni-1991-roku-tsilkom-1682282231.html\"\u003ewith RBC Ukraine\u003c/a\u003e, he said: “The only places on the frontline where they are making attempts are in the city of Bakhmut, an attempt to cover the city of Avdiivka from the north, and localised fighting in the city of Marinka. Both in Avdiivka and Marinka the tactics are identical to those in Bakhmut – just an attempt to wipe the settlement off the face of the Earth.”\u003c/p\u003e\u003c/li\u003e \u003cli\u003e\u003cp\u003e\u003cstrong\u003eUN secretary-general António Guterres has proposed to Russian president Vladimir Putin a “way forward aimed at the improvement, extension and expansion” of a deal allowing the safe Black Sea export of Ukrainian grain\u003c/strong\u003e, which Moscow has threatened to terminate from 18 May. Russia’s defence ministry meanwhile accused Ukraine of attempting to attack its ships in the Black Sea, which it said was threatening prospects of extending the deal.\u003c/p\u003e\u003c/li\u003e \u003cli\u003e\u003cp\u003e\u003cstrong\u003eA woman charged with killing a pro-war Russian military blogger using explosives has been denied bail by a Russian court.\u003c/strong\u003e Darya Trepova, 26, is accused of killing Vladen Tatarsky, whose real name was Maxim Fomin, on 2 April. He was presented with a statuette containing a bomb while giving a talk at a cafe in St Petersburg.\u003c/p\u003e\u003c/li\u003e \u003cli\u003e\u003cp\u003e\u003cstrong\u003eUkrainian authorities say \u003ca href\u003d\"https://www.theguardian.com/world/2023/apr/24/russian-forces-forcibly-evacuating-civilians-kherson-ukraine\"\u003eRussian forces are “forcibly evacuating”\u003c/a\u003e civilians in the parts of the Kherson region that they still occupy\u003c/strong\u003e, a day after it was claimed Ukrainian forces had established a bridgehead on the east bank of the Dnieper River. The claim cannot be verified, but it comes amid an apparent increase in Ukrainian military activity in the south of the country which some analysts have interpreted as a potential precursor to Kyiv’s long anticipated counter-offensive.\u003c/p\u003e\u003c/li\u003e \u003cli\u003e\u003cp\u003e\u003cstrong\u003eEstonia’s prime minister Kaja Kallas voiced hope that EU membership talks with Kyiv could begin this year, during a visit to the Ukrainian city of Zhytomyr\u003c/strong\u003e. “It will be a hard process and the requirements need to be fulfilled 100%,” she said, speaking alongside Ukraine’s president Volodymyr Zelenskiy. Estonia has been one of Ukraine’s largest donors per capita and this was Kallas’s first visit after her party won a landslide victory for her pro-Ukraine platform last month.\u003c/p\u003e\u003c/li\u003e \u003cli\u003e\u003cp\u003e\u003cstrong\u003eBeijing has insisted \u003ca href\u003d\"https://www.theguardian.com/world/2023/apr/24/china-rows-back-after-envoy-denies-sovereignty-of-former-soviet-states\"\u003eit respects the status\u003c/a\u003e of the independent nations that emerged from the USSR after remarks by China’s ambassador to France questioning the sovereignty of former Soviet states sparked outrage in EU capitals\u003c/strong\u003e. “The Chinese side respects the status of the member states as sovereign states after the collapse of the Soviet Union,” the foreign ministry’s spokesperson Mao Ning said, adding that on the issue of territorial sovereignty, Beijing’s position was consistent and clear.\u003c/p\u003e\u003c/li\u003e \u003cli\u003e\u003cp\u003e\u003cstrong\u003eThe EU foreign policy chief, Josep Borrell, expressed confidence that the bloc would complete a plan within days to buy ammunition for Ukraine after Kyiv expressed frustration at wrangling among EU member states. \u003c/strong\u003e“Yes, still there is some disagreement. But I am sure everybody will understand that we are in a situation of extreme urgency,” Borrell said.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e \u003c/div\u003e   \u003c/div\u003e"}